<template>
	<div class="special-css-page page">
		<div class="grid-container">
			<div class="item">1</div>
			<div class="item">2</div>
			<div class="item">3</div>
			<div class="item">4</div>
			<div class="item">5</div>
			<div class="item">6</div>
			<div class="item">7</div>
			<div class="item">8</div>
			<div class="item">9</div>
			<!-- <div class="item">10</div> -->
		</div>
	</div>
</template>

<script setup lang="ts"></script>

<style lang="scss" scoped>
	.special-css-page {
		padding: 10px;
	}
	.grid-container {
		display: grid;
		grid-template-columns: 1fr 1fr 1fr;
		gap: 10px;
		grid-template-areas:
			'a b c'
			'd c d'
			'e f .';
		grid-auto-flow: row dense;
		.item {
			background-color: #fff;
			min-height: 200px;
			border-radius: 5px;
			display: flex;
			justify-content: center;
			align-items: center;
		}
	}
</style>

<!-- 个人项目
1、项目包含一套后端接口，通过 nodejs + koa + mysql进行开发，部署到华为云服务器 地址：admin.lzoxun.top
2、提供用户登录注册、用户列表增删改查、动态和评论的增删改查、头像上传、图片上传，nodejs-websocket实现的websocket消息推送等功能
3、有通过docusaurus开发的学习总结笔记博客系统
3、前端部分是一套自己开发的管理系统，通过iframe引入了一下，个人其他项目以及作品，正在不断完善中

技术栈：vite + vue3 + pinia + element-plus + ts
负责内容：独立完成模块开发与部署所有流程

前端部分：前端有个人的原生微信小程序项目，vue3项目，vite后台管理系统项目， react版本项目都通过这一套接口实现的项目的开发，实践，提高动手能力，可以更好的熟练新技术 -->

<!-- 为高速购买设备单独提供的系统
主要功能：
1、高速为了明确巡检人员是否完成巡检，购买了感应类型设备
2、我们在高速个段安装RFID卡，巡检人员带着移动设备，经过FRID卡附近，平台就会接收到今天某个FRID卡设备以被检测
3、管理者可以再地图选择日期，通过海量点标记，被巡检到的数据显示高亮，管理员很直观的指定巡检人员是否有在认真工作


技术栈：RuoYi框架 + vue2全家桶+elementUI + Axios + 高德地图
负责内容：独立完成前端项目选型、开发与部署 -->

<!-- 该项目是近期推出的业务推广系统，分为两部分，微信小程序端用户使用和管理员管理的后台系统，小程序端方便业务人员推广给合作伙伴进行跟踪客户，售卖产品，管理平台负责管理代理商的加入，升级。订单的审核等操作，可以让管理员查看各个业绩状况

业务管理系统，分为提供给用户使用的微信小程序系统（辉和业务管理平台），和公司管理员管理用的管理系统部分
主要作用：
1、公司业务员可以邀请合作伙伴进来、经过管理员在后台审核后称为邀请者的下级业务员
2、业务员可以浏览商品、添加自己的客户、当客户有购买需求时，添加报备、创建订单
3、客户与公司交易完成，管理员通过订单审核，发货，成功交易后业务员账户就会产生佣金，邀请他的业务员也会得到一部分佣金


技术栈：小程序端是通过uni-app开发，发行到微信小程序中
对应的管理平台：vue3+vue-router+pinia+element-plus
负责内容：独立完成前端模块开发与部署 -->

<!-- 该项目是公司为客户开发的一款设备管理系统，用户购买设备后，售后将硬件设备与用户微信，用户进入系统可以看到GIS地图看到自己权限设备的位置与状态，也能通过类别的方式查看权限设备，点击设备详情，可以查看设备的基本信息，消息告警，售后报修，指令发送，或通过cron定时执行设备指令等一些列用户需求。
项目从19年4月份左右开始开发，19年12月份基本完成，后期不断开发升级优化，不断添加新的东西，日常维护

微信公众号H5项目，分辉和自己版本（辉和科技云）、给通佰公司提供(TB物联网安全)、给森润达公司提供(Anbox猎狐平台)三个版本，三套皮肤，功能大致相同
主要作用：
1、用户可以直接通过手机查看自己购买的设备，位置、状态、接收公共号推送设备告警
2、用户可以直接在手机上操作设备，直接向硬件设备发送指令
3、为用户提供设备报修，问题反馈等功能

技术栈：vue2+ vuex +vue-router + mint-ui + 高德地图 + axios
负责模块：web前端部分项目搭建与发布上线
适配方案： postpxtoviewport适配方案开发的h5页面。axios请求封装统一tokey与异常处理 -->

<!-- 用户管理系统、物联网物联网设备管理系统、SaaS系统
主要功能
    1、管理购买公司设备客户信息，权限分配，通过基于角色的权限管理管理用户
	2、管理公司设备的生产配置、购买合同管理、设备状态测试状态还是出货状态、外设信息、是否短信接收，或微信推送设备告警，指令发送，cron定时发送，设备粘贴码和权限二维码等
	3、高德地图实时查看设备位置、websocket实时监控设备产生的告警，通过队列存储每一条告警，调用语音接口，传入播报的文字，使用audio语音实时播报
	4、特殊用户购买设备后，可以将系统直接部署给他们使用，他们提供logo、域名（或使用我们的子域名）、一些关键的文字，全面一点的还为他们专门提供定制皮肤，通过不同域名动态映入不同scss样式文件
	5、项目中大量使用Echarts统计数据、websocket接收信息和硬件指令调试、高德地图、不同样式的监控大屏等功能


项目是一个物联网后台管理系统，当用户首次进入微信系统时需要绑定手机号，平台会生成账号与微信关联，用户可以直接通过微信扫码进入后台系统，也能通过账号登录，普通用户一般只有基本权限只能看到有自己设备相关的功能菜单
以超级管理员为例，超级管理员拥有系统所有菜单权限和按钮权限，进入系统后首先可以看到，统计报表模块、监控大屏模块、串口管理、能耗管理、设备测试、运维管理、业务配置、硬件配置、系统管理、业务管理、设备管理几大模块。

1、统计报表模块：通过echart展现平台各个报表功能，将数据转换为可视化数据，包括设备出货统计、设备离线统计、型号强度统计等20几个统计指标，项目中将echart安装饼图、柱形图、折线图等各自封装成单独二级组件，在一个基础组件总统一初始化echarts的基础组件，接收二级组件传来的数据，二级组件按照自己的规则接收各个页面传递的数据进行展示
2、监控大屏模块：监控到页面有四个不同版本，是基于高德的图与echarts图表开发的，通过flex适配，通过websocket接收设备告警信息，实时监控并且会通过语音播报告警内容
3、系统管理模块：系统权限采用RBAC基于角色的访问控制，给用户分配角色，给角色分配菜单权限和菜单按钮权限，此外我们还给用户也能直接绑定权限菜单和按钮，方便为某些特殊用户分配一些零零散散的权限

总体来说项目时比较庞大的从2019.5至今一致都在逐渐开发与维护，是公司管理产品与配最主要的平台，后期不断开发升级优化，不断添加新的东西，日常维护

技术栈：vue2 + vue-router +vuex + axios + element-ui + echarts + websoket + vue-amap + cron
负责内容：项目搭建，axios封装，路由配置，权限系统，页面开发，发布上线，全部web相关
难点：多平台皮肤动态替换、监控大屏、gis地图 -->
